# StructuralSectionCommonWarpingConstant Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonWarpingConstant Property
ParameterTypeId Class See Also
---
"Warping Constant"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonWarpingConstant { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonWarpingConstant As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonWarpingConstant {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace